from flask import Flask
from flask import render_template
import random

app = Flask(__name__)


lst = [
    'Большинство людей, страдающих технологической зависимостью, испытывают сильный стресс, когда они находятся вне зоны покрытия сети или не могут использовать свои устройства.',
    'Согласно исследованию, проведенному в 2018 году, более 50% людей в возрасте от 18 до 34 лет считают себя зависимыми от своих смартфонов.',
    'Изучение технологической зависимости является одной из наиболее актуальных областей научных исследований в настоящее время.',
    'Согласно исследованию, проведенному в 2019 году, более 60% людей отвечают на рабочие сообщения в своих смартфонах в течение 15 минут после того, как они вышли с работы.',
    'Илон Маск утверждает, что социальные сети созданы для того, чтобы удерживать нас внутри платформы, чтобы мы тратили как можно больше времени на просмотр контента.',
    'Илон Маск также выступает за регулирование социальных сетей и защиту личных данных пользователей. Он утверждает, что социальные сети собирают огромное количество информации о нас, которую потом можно использовать для манипулирования нашими мыслями и поведением.'
]

coin_side = [
    'орел', 'решка'
]

@app.route('/random')
def random_fact():
    return f'<p>{random.choice(lst)}</p>'

@app.route("/")
def hello_world():
    return render_template('index.html', f = random.choice(lst))

@app.route('/coin')
def coin():
    return f'<p>{random.choice(coin_side)}</p>'


app.run()